
import streamlit as st

# Заглавие
st.title("Оразмеряване на пътна конструкция")

# Секция за въвеждане на данни
st.subheader("Въведете характеристики")

# Падащо меню за D
d_value = st.selectbox("Изберете стойност за D:", options=["32.04", "34"])

# Падащо меню за осов товар
axle_load = st.selectbox("Изберете стойност за осов товар (kN):", options=["100", "115"])

# Показване на избраните стойности
st.write(f"Избрана стойност за D: {d_value}")
st.write(f"Избрана стойност за осов товар: {axle_load} kN")
